package Lesson4;

public class lesson4Class {
    public static void main(String[] args) {
        /*
        Экземпляр класса — это конкретный объект данного класса, за которым
        закрепляется определенная память. А класс - это только описание свойств
        и способов выполнения над его объектами различных операций (методов).
        Каждый класс может иметь одновременно несколько объектов (экземпляров),
        каждый из которых имеет одни и те же свойства и методы.

        структура джава класса

        the package statement
        the import statement
        class declaration and definitions

        variables (переменные)
        method
        constructors
        comments

        --название файла и название класса всегда одинаково !
        можно создать неограаниченное кол классов в файле
        в файле может и не быть pablic класса
         */



    }
}
